#include <stdio.h>

int minSteps(int x, int y)
{
    // Базовий випадок: якщо початкове значення (x) рівне кінцевому значенню (y), повертаємо 0
    if (x == y)
    {
        return 0;
    }

    // Ініціалізуємо лічильник кроків (steps) як 1, так як перший крок завжди буде 1
    int steps = 1;
    // Обчислюємо різницю між кінцевим значенням (y) і початковим значенням (x)
    int difference = y - x;

    // Виконуємо цикл, поки різниця більша за кількість вже виконаних кроків
    while (difference > steps)
    {
        // Якщо різниця між кінцевим і початковим значеннями менша або дорівнює подвоєному значенню кроків,
        // то можна дійти до кінцевого значення залишивши кількість кроків в різниці
        if (difference <= 2 * steps)
        {
            difference = 0;
        }
        // Збільшуємо лічильник кроків на 1
        steps++;
    }

    // Повертаємо мінімальну кількість кроків
    return steps;
}

int main()
{
    // Змінні для збереження початкового (x) та кінцевого (y) значень
    int x, y;

    // Введення початкового значення
    printf("Enter x - ");
    scanf("%d", &x);

    // Введення кінцевого значення
    printf("Enter y - ");
    scanf("%d", &y);

    // Виклик функції для обчислення мінімальної кількості кроків та виведення результату
    printf("\nResult - %d", minSteps(x, y));

    return 0;
}




